MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MKW38Z512VFT4/mcu.h
/* The count of PFLEXNVM_TAGVDW0S */
#define PFLEXNVM_TAGVDW0S_COUNT                  (4U)

/*! @name TAGVDW1S - Cache Tag Storage */
/*! @{ */
#define PFLEXNVM_TAGVDW1S_valid_MASK             (0x1U)
#define PFLEXNVM_TAGVDW1S_valid_SHIFT            (0U)
/*! valid - 1-bit valid for cache entry
 */
#define PFLEXNVM_TAGVDW1S_valid(x)               (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_TAGVDW1S_valid_SHIFT)) & PFLEXNVM_TAGVDW1S_valid_MASK)
#define PFLEXNVM_TAGVDW1S_tag_MASK               (0x7FFC0U)
#define PFLEXNVM_TAGVDW1S_tag_SHIFT              (6U)
/*! tag - 13-bit tag for cache entry
 */
#define PFLEXNVM_TAGVDW1S_tag(x)                 (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_TAGVDW1S_tag_SHIFT)) & PFLEXNVM_TAGVDW1S_tag_MASK)
/*! @} */

/* The count of PFLEXNVM_TAGVDW1S */
#define PFLEXNVM_TAGVDW1S_COUNT                  (4U)

/*! @name TAGVDW2S - Cache Tag Storage */
/*! @{ */
#define PFLEXNVM_TAGVDW2S_valid_MASK             (0x1U)
#define PFLEXNVM_TAGVDW2S_valid_SHIFT            (0U)
/*! valid - 1-bit valid for cache entry
 */
#define PFLEXNVM_TAGVDW2S_valid(x)               (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_TAGVDW2S_valid_SHIFT)) & PFLEXNVM_TAGVDW2S_valid_MASK)
#define PFLEXNVM_TAGVDW2S_tag_MASK               (0x7FFC0U)
#define PFLEXNVM_TAGVDW2S_tag_SHIFT              (6U)
/*! tag - 13-bit tag for cache entry
 */
#define PFLEXNVM_TAGVDW2S_tag(x)                 (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_TAGVDW2S_tag_SHIFT)) & PFLEXNVM_TAGVDW2S_tag_MASK)
/*! @} */

/* The count of PFLEXNVM_TAGVDW2S */
#define PFLEXNVM_TAGVDW2S_COUNT                  (4U)

/*! @name TAGVDW3S - Cache Tag Storage */
/*! @{ */
#define PFLEXNVM_TAGVDW3S_valid_MASK             (0x1U)
#define PFLEXNVM_TAGVDW3S_valid_SHIFT            (0U)
/*! valid - 1-bit valid for cache entry
 */
#define PFLEXNVM_TAGVDW3S_valid(x)               (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_TAGVDW3S_valid_SHIFT)) & PFLEXNVM_TAGVDW3S_valid_MASK)
#define PFLEXNVM_TAGVDW3S_tag_MASK               (0x7FFC0U)
#define PFLEXNVM_TAGVDW3S_tag_SHIFT              (6U)
/*! tag - 13-bit tag for cache entry
 */
#define PFLEXNVM_TAGVDW3S_tag(x)                 (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_TAGVDW3S_tag_SHIFT)) & PFLEXNVM_TAGVDW3S_tag_MASK)
/*! @} */

/* The count of PFLEXNVM_TAGVDW3S */
#define PFLEXNVM_TAGVDW3S_COUNT                  (4U)

/*! @name DATAW0S0U - Cache Data Storage (upper word) */
/*! @{ */
#define PFLEXNVM_DATAW0S0U_data_MASK             (0xFFFFFFFFU)
#define PFLEXNVM_DATAW0S0U_data_SHIFT            (0U)
/*! data - Bits [63:32] of data entry
 */
#define PFLEXNVM_DATAW0S0U_data(x)               (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_DATAW0S0U_data_SHIFT)) & PFLEXNVM_DATAW0S0U_data_MASK)
/*! @} */

/*! @name DATAW0S0L - Cache Data Storage (lower word) */
/*! @{ */
#define PFLEXNVM_DATAW0S0L_data_MASK             (0xFFFFFFFFU)
#define PFLEXNVM_DATAW0S0L_data_SHIFT            (0U)
/*! data - Bits [31:0] of data entry
 */
#define PFLEXNVM_DATAW0S0L_data(x)               (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_DATAW0S0L_data_SHIFT)) & PFLEXNVM_DATAW0S0L_data_MASK)
/*! @} */

/*! @name DATAW0S1U - Cache Data Storage (upper word) */
/*! @{ */
#define PFLEXNVM_DATAW0S1U_data_MASK             (0xFFFFFFFFU)
#define PFLEXNVM_DATAW0S1U_data_SHIFT            (0U)
/*! data - Bits [63:32] of data entry
 */
#define PFLEXNVM_DATAW0S1U_data(x)               (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_DATAW0S1U_data_SHIFT)) & PFLEXNVM_DATAW0S1U_data_MASK)
/*! @} */

/*! @name DATAW0S1L - Cache Data Storage (lower word) */
/*! @{ */
#define PFLEXNVM_DATAW0S1L_data_MASK             (0xFFFFFFFFU)
#define PFLEXNVM_DATAW0S1L_data_SHIFT            (0U)
/*! data - Bits [31:0] of data entry
 */
#define PFLEXNVM_DATAW0S1L_data(x)               (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_DATAW0S1L_data_SHIFT)) & PFLEXNVM_DATAW0S1L_data_MASK)
/*! @} */

/*! @name DATAW0S2U - Cache Data Storage (upper word) */
/*! @{ */
#define PFLEXNVM_DATAW0S2U_data_MASK             (0xFFFFFFFFU)
#define PFLEXNVM_DATAW0S2U_data_SHIFT            (0U)
/*! data - Bits [63:32] of data entry
 */
#define PFLEXNVM_DATAW0S2U_data(x)               (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_DATAW0S2U_data_SHIFT)) & PFLEXNVM_DATAW0S2U_data_MASK)
/*! @} */

/*! @name DATAW0S2L - Cache Data Storage (lower word) */
/*! @{ */
#define PFLEXNVM_DATAW0S2L_data_MASK             (0xFFFFFFFFU)
#define PFLEXNVM_DATAW0S2L_data_SHIFT            (0U)
/*! data - Bits [31:0] of data entry
 */
#define PFLEXNVM_DATAW0S2L_data(x)               (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_DATAW0S2L_data_SHIFT)) & PFLEXNVM_DATAW0S2L_data_MASK)
/*! @} */

/*! @name DATAW0S3U - Cache Data Storage (upper word) */
/*! @{ */
#define PFLEXNVM_DATAW0S3U_data_MASK             (0xFFFFFFFFU)
#define PFLEXNVM_DATAW0S3U_data_SHIFT            (0U)
/*! data - Bits [63:32] of data entry
 */
#define PFLEXNVM_DATAW0S3U_data(x)               (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_DATAW0S3U_data_SHIFT)) & PFLEXNVM_DATAW0S3U_data_MASK)
/*! @} */

/*! @name DATAW0S3L - Cache Data Storage (lower word) */
/*! @{ */
#define PFLEXNVM_DATAW0S3L_data_MASK             (0xFFFFFFFFU)
#define PFLEXNVM_DATAW0S3L_data_SHIFT            (0U)
/*! data - Bits [31:0] of data entry
 */
#define PFLEXNVM_DATAW0S3L_data(x)               (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_DATAW0S3L_data_SHIFT)) & PFLEXNVM_DATAW0S3L_data_MASK)
/*! @} */

/*! @name DATAW1S0U - Cache Data Storage (upper word) */
/*! @{ */
#define PFLEXNVM_DATAW1S0U_data_MASK             (0xFFFFFFFFU)
#define PFLEXNVM_DATAW1S0U_data_SHIFT            (0U)
/*! data - Bits [63:32] of data entry
 */
#define PFLEXNVM_DATAW1S0U_data(x)               (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_DATAW1S0U_data_SHIFT)) & PFLEXNVM_DATAW1S0U_data_MASK)
/*! @} */

/*! @name DATAW1S0L - Cache Data Storage (lower word) */
/*! @{ */
#define PFLEXNVM_DATAW1S0L_data_MASK             (0xFFFFFFFFU)
#define PFLEXNVM_DATAW1S0L_data_SHIFT            (0U)
/*! data - Bits [31:0] of data entry
 */
#define PFLEXNVM_DATAW1S0L_data(x)               (((uint32_t)(((uint32_t)(x)) << PFLEXNVM_DATAW1S0L_data_SHIFT)) & PFLEXNVM_DATAW1S0L_data_MASK)
/*! @} */

